# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks_resources.azapi_resource.dis_pgsql_operator[0] will be created
  + resource "azapi_resource" "dis_pgsql_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + dis-pgsql = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISPG_AKS_RESOURCE_GROUP          = "MC_admin-test-rg_admin-test-aks_norwayeast"
                              + DISPG_AKS_VNET_NAME               = "admin-test-vnet"
                              + DISPG_AZURE_SUBSCRIPTION_ID       = "1ce8e9af-c2d6-44e7-9c5e-099a308056fe"
                              + DISPG_AZURE_TENANT_ID             = (sensitive value)
                              + DISPG_DB_RESOURCE_GROUP           = "DIS_admin-test_main-rg"
                              + DISPG_DB_VNET_NAME                = "test-pgsql-vnet"
                              + DISPG_WORKLOAD_IDENTITY_CLIENT_ID = "8c4ad610-5676-42cf-8510-0325220fa61e"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring1"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/dis-pgsql"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "dis-pgsql"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.azure_service_operator.azurerm_role_definition.user_assigned_identity_role_dis_aks_vnet will be updated in-place
  ~ resource "azurerm_role_definition" "user_assigned_identity_role_dis_aks_vnet" {
        id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/c60bc823-8ead-4994-7fd1-482d9216d860|/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.Network/virtualNetworks/admin-test-vnet"
        name                        = "dis-aso-vnet-join-admin-test"
        # (5 unchanged attributes hidden)

      ~ permissions {
          ~ actions          = [
                "Microsoft.Network/virtualNetworks/join/action",
              + "Microsoft.Network/virtualNetworks/read",
                "Microsoft.Authorization/*/read",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.test-pgsql-vnet.azurerm_role_assignment.dispgsql_network_reader will be created
  + resource "azurerm_role_assignment" "dispgsql_network_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dfc3a965-3864-4571-9a75-e8fb58de9e70"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/DIS_admin-test_main-rg/providers/Microsoft.Network/virtualNetworks/test-pgsql-vnet"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @sduranc |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan` |